z<!DOCTYPE HTML  PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3c.org/html4/HTML4-loose.dtd">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="content-language" content="es">

<TITLE>Investigaci&oacute;n &mdash; Docencia
&mdash; Schaeffer</title>

    <link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
    <link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
    <link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
    <link rel="manifest" href="/site.webmanifest">
    <link rel="mask-icon" href="/safari-pinned-tab.svg" color="#5bbad5">
    <meta name="msapplication-TileColor" content="#da532c">
    <meta name="theme-color" content="#ffffff">

<LINK rel="stylesheet" type="text/css" href="teaching.css">

</HEAD>

<BODY>
<div id="elementos">  
  <div id="navibar">
    <p>
      <a href=".">satuelisa</a> /
      <a href="teaching.html">Docencia</a> / 
Investigaci&oacute;n
    </p>
  </div>


<div ID="contenido">
<H1>Investigaci&oacute;n</h1>
<h2>M&oacute;dulo de libre elecci&oacute;n<br />
<small>22 cr</small></h2>

<p>
Esta es la p&aacute;gina web para los estudiantes de d&eacute;cimo
semestre (programa educativo ITS/IAS/IMTC) en
la <a href="http://www.fime.uanl.mx">FIME</a> de
la <a href="http://www.uanl.mx">UANL</a> preparando una
investigaci&oacute;n cient&iacute;fica que tendr&aacute; como producto
una tesis de licenciatura, dando posiblemente lugar a publicaciones en
revistas y/o participaci&oacute;n en congresos, supervisada por
<a href=".">Elisa Schaeffer</a>, de forma
semi-presencial (a distancia en situaci&oacute;n de contingencia) de <em>tiempo completo</em> (se espera que el alumno
invierta en promedio 40 horas semanales en el trabajo durante 16
semanas, dando un total de 640 horas).
</p>
<h3>Inscripci&oacute;n</h3>
<p>
  La inscripci&oacute;n se realiza con formatos que se entregan a la
  Subdirecci&oacute;n de Posgrado (informarse ah&iacute;) por lo menos
  un mes antes de que termine el semestre anterior. Requiero lo
  siguiente para considerar admitir un alumno bajo mi asesor&iacute;a:
  <ul>
    <li>Instalaci&oacute;n y uso b&aacute;sico de <a href="https://www.latex-project.org/">LaTeX</a>.</li>
    <li>Descarga, modificaci&oacute;n y compilaci&oacute;n de la
    <a href="http://logistica.fime.uanl.mx/miguel/docs/Tesis-FIME.zip">plantilla</a>
    de LaTeX con su nombre, carrera, t&iacute;tulo tentativo,
    descripci&oacute;n breve del tema propuesto (en el primer
    cap&iacute;tulo) y autobiograf&iacute;a adecuadamente colocados.</li>
    <li>Instalaci&oacute;n y uso b&aacute;sico de un corrector automatizado
    de ortograf&iacute;a para el idioma en que se escribir&aacute; la
    tesis en la computadora que el alumno utilizar&aacute; para la
      redacci&oacute;n.</li>
    <li>Conocimientos s&oacute;lidos de la gram&aacute;tica del idioma
    seleccionado para la redacci&oacute;n.</li>
    <li>Creaci&oacute;n de una cuenta en GitHub y la alta de un
      repositorio para colocar todo lo que se desarrolla en la
      tesis.</li>
    <li>Selecci&oacute;n de una licencia de c&oacute;gigo abierto para
      lo desarrollado en la tesis.</li>
    <li>Instalaci&oacute;n y conocimiento b&aacute;sico
    de <a href="https://www.r-project.org/">R</a> para poder realizar
      pruebas estad&iacute;sticas.</li>
    <li>Instalaci&oacute;n y uso b&aacute;sico
    de <a href="http://www.gnuplot.info/">gnuplot</a> para
    visualizaci&oacute;n de informaci&oacute;n.</li>
    <li>Lectura previa comprensiva de los siguientes libros y documentos:
      <ul>	
	<li><a href="https://www.crockford.com/wrrrld/style.html">The Elements of Style</a></li>
	<li><a href="http://www.springer.com/gp/book/9781447166382">Writing for Computer Science</a></li>
	<li><a href="http://tex.loria.fr/typographie/mathwriting.pdf">Mathematical Writing</a></li>
	<li><a href="http://www.fime.uanl.mx/docs/t6.pdf">T&iacute;tulo Sexto del Reglamento de la FIME</a></li>
      </ul>
    </li>
  </ul>
 Recomiendo adem&aacute;s iniciar el proceso por lo menos tres meses
 antes de que inicie el semestre en el cual se inscribe la unidad para
 llevar un avance previo que permite mayor flexibilidad en los tiempos
 durante el semestre principal.
</p>
<h3>Registros de tesis</h3>
<p>
Los registros de tesis se realizan a m&aacute;s tardar cuando se
define el comit&eacute; revisor alrededor de medio curso. La defensas
de tesis se programan una vez que el manuscrito haya sido aprobado por
el comit&eacute; revisor (se somete el manuscrito a evaluaci&oacute;n
terminando la &uacute;ltima fase) despu&eacute;s de que se tramiten
los actas, estimando que ser&aacute;n aproximadamente uno o dos meses
despu&eacute;s de concluir la unidad de aprendizaje. Si un alumno
trabaja de forma intensiva y concluye las fases m&aacute;s temprano,
se pueden adelantar estos procesos.
</p>
<p>
El alumno puede elegir entre espa&ntilde;ol e ingl&eacute;s para sus
redacciones, con que realice todo el trabajo en un solo idioma.
</p>
<h3>Fases</h3>
<p>
Cada fase semanal otorga por m&aacute;ximo diez puntos y el total
m&aacute;ximo es de 160 puntos, de los cuales el alumno debe completar
por m&iacute;nimo el 70 por ciento (112 puntos) y completar
satisfactoriamente por lo menos un producto cient&iacute;fico (un
p&oacute;ster para exponer en un congreso, un art&iacute;culo para
publicar en congreso o revista y/o la tesis para defender) para
aprobar la unidad (aparecer&aacute; como "CU" en su k&aacute;rdex).
<p>
La distribuci&oacute;n de los diez puntos semanales sigue la siguiente
ponderaci&oacute;n de cuatro aspectos a evaluar:
<ul>
<li>una reuni&oacute;n inicial  (10 %)</li>
<li>una entrega de avance algor&iacute;tmico, de c&oacute;digo,
experimentaci&oacute;n o un an&aacute;lisis (40 %)</li>
<li>una entrega de un
escrito (40 %)</li>
<li>una reuni&oacute;n final (10 %)</li>
</ul>
donde el contenido espec&iacute;fico de la entrega de avance y del
escrito es acordado entre el alumno y el supervisor en la
reuni&oacute;n inicial.
</p>
<p>
El contenido espec&iacute;fico de cada fase depende del tema de cada
estudiante. El estudiante mantendr&aacute; en su blog minutas de las
reuniones y de los acuerdos del contenido de las fases. La
reuni&oacute;n inicial de una fase por lo general se organiza
conjuntamente con la reuni&oacute;n final de la fase anterior. Las
reuniones son individuales entre el alumno y el supervisor. Se indica
la fecha l&iacute;mite de entrega de cada fase entre par&eacute;ntesis
hasta que se haya cerrado la fase en cuesti&oacute;n; la entrega se realiza en una
reuni&oacute;n presencial o en l&iacute;nea con el supervisor y no
puede ser reemplazada por un env&iacute;o de correo electr&oacute;nico
o una publicaci&oacute;n en el blog sin el elemento interactivo en
tiempo real. La solicitud de establecer la reuni&oacute;n debe
realizarse con por lo menos dos d&iacute;as h&aacute;biles de
anticipaci&oacute;n.
</p>
<p>
<ol>
<li>Planteamiento del tema y preparaci&oacute;n de la plantilla</li>
<li>Hip&oacute;tesis y objetivos</li>
<li>Identificaci&oacute;n y estructuraci&oacute;n de
antecedentes</li>
<li>B&uacute;squeda y clasificaci&oacute;n de trabajos relacionados</li>
<li>An&aacute;lisis comparativo &amp; identificaci&oacute;n del &aacute;rea de oportunidad</li>
<li>Dise&ntilde;o de la soluci&oacute;n propuesta</li>
<li>Implementaci&oacute;n de la soluci&oacute;n propuesta</li>
<li>Dise&ntilde;o experimental</li>
<li>Reportaje de resultados experimentales</li>
<li>An&aacute;lisis de experimentos</li>
<li>Conclusiones y trabajo a futuro</li>
<li>Env&iacute;o a revisi&oacute;n por el comit&eacute;</li>
<li>Preparaci&oacute;n de una presentaci&oacute;n</li>
<li>Preparaci&oacute;n de un p&oacute;ster</li>
<li>Preparaci&oacute;n de un art&iacute;culo</li>
<li>Compilaci&oacute;n de portafolio de evidencias</li>
</ol>
</p>
<p>
No habr&aacute; una segunda oportunidad equivalente al examen
extraordinario. La calificaci&oacute;n "CU" se manda al departamento
escolar concluyendo la semana de examen ordinario.
</p>
<p> Se deben anexar en PDF los documentos comprobatorios completos del
producto en el portafolio de evidencias.</p>

<h3>Resultados</h3>

<h4>Enero&ndash;junio 2022</h4>
<table border="1">
<tr>
  <th rowspan="2">Alumno<br/><small>(Repo)</small></th>
  <th colspan="16" rowspan="1">Fase</th>
  <th rowspan="2">Total<br /><small></small></th>
  <th rowspan="2">% (CF)</th>
</tr>
<tr>
  <th>1</th>
  <th>2</th>
  <th>3</th>
  <th>4</th>
  <th>5</th>
  <th>6</th>
  <th>7</th>
  <th>8</th>
  <th>9</th>
  <th>10</th>
  <th>11</th>
  <th>12</th>
  <th>13</th>
  <th>14</th>
  <th>15</th>
  <th>16</th>
</th>
</tr>

<tr>
  <th><a href="https://github.com/DanielFL0/traffic-optimization-rl-agent/tree/thesis">D</a></th>
  <td>1431</td>
  <td colspan="17" align="center">baja en febrero por razones personales</td></tr>


<tr>
  <th><a href="https://github.com/selenebpradop/relaciones-contaminantes-salud">SB</a></th>
  <td>1441</td><td>1431</td><td>1441</td><td>1441</td>
  <td>1441</td><td>1441</td><td>1421</td><td>1421</td>
  <td>1431</td><td>1431</td><td>1431</td>
</tr>


</table>

</div>
<div id="pie">
  <hr noshade />
  Actualizado el 29 de marzo del 2022.
<br>
  URL: https://satuelisa.github.io/bscthesis.html
</div>
</div>

</BODY>
</HTML>
