<!DOCTYPE HTML  PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3c.org/html4/HTML4-loose.dtd">
<HTML>
  <HEAD>
    <META HTTP-EQUIV="Content-Type"
	  content="text/html; charset=iso-8859-1">
    <meta http-equiv="content-language" content="es">
    
    <TITLE>Metodolog&iacute;a de la investigaci&oacute;n
      &mdash; Docencia
      &mdash; Schaeffer</title>
    
    <LINK rel="stylesheet" type="text/css" href="teaching.css">
   <link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
    <link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
    <link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
    <link rel="manifest" href="/site.webmanifest">
    <link rel="mask-icon" href="/safari-pinned-tab.svg" color="#5bbad5">
    <meta name="msapplication-TileColor" content="#da532c">
    <meta name="theme-color" content="#ffffff">
    
  </HEAD>
  
  <BODY>
    <div id="elementos">  
      <div id="navibar">
	<p>
	  <a href=".">Schaeffer</a> /
	  <a href="teaching.html">Docencia</a> / 
	  Metodolog&iacute;a de la investigaci&oacute;n
	</p>
      </div>
      
      <div ID="contenido">
	<H1>Metodolog&iacute;a de la investigaci&oacute;n</h1>
	<h2>Posgrado</h2>
	
	<p>
	  Esta es la p&aacute;gina web para los estudiantes de segundo
	  semestre de maestr&iacute;a y quinto semestre de doctorado
	  de <a href="http://pisis.fime.uanl.mx">PISIS</a> de
	  la <a href="http://www.fime.uanl.mx">FIME</a> de
	  la <a href="http://www.uanl.mx">UANL</a>, bajo la
	  instrucci&oacute;n de Elisa Schaeffer</a> en
	  agosto-diciembre 2021 y nuevamente en colaboraci&oacute;n
	  con Arturo Berrones en enero-junio 2022. Las sesiones se
	  organizan por Discord y se trasmiten por YouTube (en el
	  canal de PISIS) los jueves en la ma&ntilde;ana (de nueve a
	  once, aproximadamente) &mdash; el resto de las horas clase
	  los participantes desarrollan las actividades y la
	  instructora les apoya por Discord en chat.
</p>
<h3>Fases</h3>
<p>
  Hay diez entregas de tareas de avances parciales, m&aacute;ximo
  cinco puntos por fase.  En la semana #17, se entrega el informe del
  proyecto integrador (m&aacute;ximo 20 puntos por el anteproyecto
  completado), para la semana #18 se defienden los anteproyectos
  (m&aacute;ximo 20 puntos por la presentaci&oacute;n, 10 por las
  diapositivas y 10 por la exposici&oacute;n) y en la semana #19 hay
  una discusi&oacute;n (m&aacute;ximo 5 puntos por la
  retroalimentaci&oacute;n entre pares y otros 5 puntos por la
  autoevaluaci&oacute;n &mdash; es obligatorio ver la grabaci&oacute;n
  de su propia defensa para esta segunda parte y las de los
  dem&aacute;s para la primera).
</p>
<p> El contenido espec&iacute;fico de cada fase depende del tema de
  cada estudiante. Todos los escritos se preparan en LaTeX y
  formar&aacute;n parte del portafolio de evidencias que se entrega en
  la semana #20.
</p>
<h3>Unidades tem&aacute;ticas</h3>
<ol>
  <li>Introducci&oacute;n a la metodolog&iacute;a cient&iacute;fica (5
  semanas)</li>
  <li>An&aacute;lisis bibliogr&aacute;fico (3 semanas)</li>
  <li>Dise&ntilde;o de la investigaci&oacute;n (3 semanas)</li>
  <li>Herramientas para la investigaci&oacute;n cient&iacute;fica (3
  semanas)</li>
  <li>Redacci&oacute;n de una propuesta de investigaci&oacute;n (6 semanas)</li>
</ol>
<h3>Agenda semanal</h3>
<p>
La interacci&oacute;n es por Discord; las sesiones se graban y se
	  suben a un playlist de YouTube. En la sesiones que se
	  plantean tareas nuevas, se discute el contenido esperado del
	  entregable y los pasos a seguir en su preparaci&oacute;n
	  para aclarar cualquier duda. En las sesiones de entrega y
	  revisi&oacute;n, los participantes toman turnos en compartir
	  su entregable en PDF por discord y luego compartir pantalla
	  para discutirlo, seguido por comentarios y preguntas de los
	  dem&aacute;s y la retroalimentaci&oacute;n de la
	  profesora.</p>
<p>
Las defensas de anteproyectos ser&aacute;n realizadas en la presencia
de sus comit&eacute;s y grabadas por el alumno (se recomienda el
software gratuito OBS para grabarlas, pero MS Teams sirve como plan B
para los menos competentes en estos temas); es importante contactar
con anticipaci&oacute;n a sus comit&eacute;s para agendar una
sesi&oacute;n para esa semana o una fecha muy cercana. La
grabaci&oacute;n se sube o como privada (unlisted) en YouTube de parte
del alumno en el caso que el comit&eacute; no lo autorize que se
incluyan en una lista de reproducci&oacute;n p&uacute;blica de PISIS.
</p>
<p>
  Las
  &uacute;ltimas dos sesiones son nuevamente por Discord.
</P>
<p>
  <ol>
    <li>UT1: Introducci&oacute;n y organizaci&oacute;n; planteamiento
    de la tarea 1</li>
    <li>UT1: Entrega y revisi&oacute;n de la tarea 1</li>
    <li>UT1: Metodolog&iacute;a cient&iacute;fica; planteamiento de
    las tareas 2 y 3</li>
    <li>UT1: Entrega y revisi&oacute;n de tarea 2</li>
    <li>UT1: Entrega y revisi&oacute;n de tarea 3</li>
    <li>UT2: An&aacute;lisis bibliogr&aacute;fico; planteamiento de
    tareas 4 y 5</li>
    <li>UT2: Entrega y revisi&oacute;n de tarea 4</li>
    <li>UT2: Entrega y revisi&oacute;n de tarea 5</li>
    <li>UT3: Dise&ntilde;o de la investigaci&oacute;n; planteamiento
    de las tareas 6 y 7</li>
    <li>UT3: Entrega y revisi&oacute;n de tarea 6</li>
    <li>UT3: Entrega y revisi&oacute;n de tarea 7</li>
    <li>UT4: Herramientas para la investigaci&oacute;n
    cient&iacute;fica; planteamiento de las tareas 8 y 9</li>
    <li>UT4: Entrega y revisi&oacute;n de tarea 8</li>
    <li>UT4: Entrega y revisi&oacute;n de tarea 9</li>
    <li>UT5: Preparaci&oacute;n y organizaci&oacute;n de una propuesta
    formal; planteamiento de la tarea 10</li>
    <li>UT5: Entrega y revisi&oacute;n de tarea 10</li>
    <li>UT5: Entrega y revisi&oacute;n de los informes de los
    proyectos integradores</li>
    <li>UT5: Defensas de anteproyectos &mdash; no necesariamente en
    hora clase, pero tienen que ser antes de la clase que sigue</li>
    <li>UT5: Discusi&oacute;n de los proyectos integradores
    (retroalimentaci&oacute;n entre pares y autoevaluaci&oacute;n)</li>
    <li>UT5: Entrega y revisi&oacute;n de portafolio de evidencias
    (incluir todas las tareas, el anteproyecto final, las diapositivas
      finales y la URL de la defensa)</li>
  </ol>
</p>
<h3>Tareas</h3>
<ol>
  <li>Investiga los requerimientos de por lo menos cinco universidades
    extranjeras sobre el contenido y la estructura de <em>un
      anteproyecto (research proposal)</em>; incluye citas claras a tus
    fuentes. Acorde a tus hallazgos, prepara un esqu&eacute;leto de
    estructura para tu propio anteproyecto.</li>
  <li>Investiga los requisitos y recomendaciones para secciones
    relacionados a reportaje de la <em>metodolog&iacute;a</em> en por lo
    menos cinco revistas indizadas de tu &aacute;rea de estudio; incluye
    citas claras a tus fuentes. Acorde a tus hallazgos, prepara un
    esqu&eacute;leto de estructura para la secci&oacute;n de
    metodolog&iacute;a de tu anteproyecto.</li>
  <Li>Redacta la secci&oacute;n de metodolog&iacute;a. Recuerda
    incluir la bibliograf&iacute;a ya citada y deja el resto del
    documento en el estado esqueletal de antes.</Li>
  <li>Investiga las gu&iacute;as sobre <em>referencias</em> de por lo
    menos tres revistas indizadas de tu &aacute;rea igual como los
    l&iacute;neamientos bibliogr&aacute;ficos referentes a las tesis de
    su nivel de por lo menos tres universidades extranjeras; incluye
    citas claras a tus fuentes. Acorde a tus hallazgos, analiza
    qu&eacute; tan bien la bibliograf&iacute;a citada en tu borrador
    actual de la <em>tesis</em> cumple con lo solicitado.</li>
  <li>Redacta las secciones que cubren <em>la introducci&oacute;n, los
      antecedentes y el estado de arte</em> de tu anteproyecto, asegurando
    que la bibliograf&iacute;a citada (siendo un subconjunto de lo que
    citar&aacute;s en la tesis), cumple con los l&iacute;neamientos que
    definiste en la tarea anterior.</li>
  <li>Investiga las indicaciones sobre <em>el reportaje de la
      soluci&oacute;n propuesta y resultados experimentales</em> de
      por lo menos tres revistas indizadas de tu &aacute;rea y
      aquellas sobre tesis de su nivel de estudios de por lo menos
      tres universidades extranjeras; incluye citas claras a tus
      fuentes. Acorde a tus hallazgos, prepara un "checklist" sobre
      aspectos de la soluci&oacute;n propuesta y experimentos por
      incluir en el anteproyecto para que cumpla con lo
      solicitado.</li>
  <li>Redacta las secciones que cubren <em>la soluci&oacute;n
      propuesta y dise&ntilde;o experimental</em> de tu anteproyecto,
    asegurando que la bibliograf&iacute;a citada (siendo un subconjunto
    de lo que citar&aacute;s en la tesis), cumple con los lineamientos
    que definiste en la tarea anterior.</li>
  <li>Crea una ID ORCID y perfiles de Scopus, Google Scholar y
    ResearchGate; si ya los tienes, actual&iacute;zalos. Incluyelos en
    tu CV junto con tu repositorio de GitHub y actualiza el CV
    tambi&eacute;n. Identifica y sigue a por lo menos cinco expertos
    de tu &aacute;rea en Google Scholar; revisa si tienen cuentas de
    Twitter y/o GitHub que puedas seguir. Evidencia todas estas
    actividades en tu entregable de la semana.</Li>
  <li>Investiga sobre repositorios de <em>pre-prints</em> de tu
    &aacute;rea, sobre la pol&iacute;tica de <em>pre-prints</em> de por
    lo menos tres revistas indizadas potenciales para publicar los
    resultados de tu proyecto. Investiga tambi&eacute;n
    potenciales <em>mailing lists</em> de tu &aacute;rea
    particular. Documenta los hallazgos en tu entregable de la
    semana.</li>
  <li>Prepara en LaTeX con <code>beamer</code> diapositivas sobre tu
    anteproyecto. Ensaya la presentaci&oacute;n grab&aacute;ndote y toma
  tiempo de cu&aacute;nto tardaste en presentarla. No incluyas la
    grabaci&oacute;n en el entregable, pero s&iacute; un screenshot de
    su duraci&oacute;n.</li>
  </ol>
<h3>Resultados</h3>

<h4>Enero&ndash;junio 2022</h4>
<table border="1">
  <tr>
    <th rowspan="2">Programa</th>    
    <th rowspan="2">Alumno</th>
    <th colspan="15" rowspan="1">Fase</th>
    <th rowspan="2">Total<br /><small></small></th>
  </tr>
  <tr>
    <th>1</th>
    <th>2</th>
    <th>3</th>
    <th>4</th>
    <th>5</th>
    <th>6</th>
    <th>7</th>
    <th>8</th>
    <th>9</th>
    <th>10</th>
    <th>In</th>
    <th>Pr</th>
    <th>Re</th>
    <th>Au</th>
    <th>PE</th>
  </tr>
  
  <tr>
    <td>Doctorado</td>
    <th>A</th>
    <td>5</td><td>5</td><td>4</td><td>5</td><td>4</td>
    <td>5</td><td>5</td><td>5</td><td>5</td>
  </tr>
  <tr>
    <td>Doctorado</td>
    <th>L</th>
    <td>5</td><td>5</td><td>3</td><td>5</td><td>4</td>
    <td>5</td><td>4</td><td>4</td><td>5</td>
  </tr>
  <tr>
    <td>Maestr&iacute;a</td>
    <th>A</th>
    <td>5</td><td>5</td><td>3</td><td>5</td><td>3</td>
    <td>5</td><td>4</td><td>4</td><td>5</td>
  </tr>
  <tr>
    <td>Maestr&iacute;a</td>
    <th>E</th>
    <td>5</td><td>5</td><td>3</td><td>5</td><td>3</td>
    <td>5</td><td>4</td><td>4</td><td>5</td>
  </tr>
  </table>

<h4>Agosto&ndash;diciembre 2021</h4>
<table border="1">
  <tr>
    <th rowspan="2">Alumno</th>
    <th colspan="15" rowspan="1">Fase</th>
    <th rowspan="2">Total<br /><small></small></th>
  </tr>
  <tr>
    <th>1</th>
    <th>2</th>
    <th>3</th>
    <th>4</th>
    <th>5</th>
    <th>6</th>
    <th>7</th>
    <th>8</th>
    <th>9</th>
    <th>10</th>
    <th>In</th>
    <th>Pr</th>
    <th>Re</th>
    <th>Au</th>
    <th>PE</th>
  </tr>

  <tr><th>A</th>
    <td>5</td><td>5</td><td>5</td><td>5</td><td>5</td>
    <td>5</td><td>4</td><td>5</td><td>4</td><td>4</td>
    <td>18</td><td align="left">10+9</td><td>4</td><td>5</td>
    <td>OK</td><th>93</th>        
  </tr>

  <tr><th>E</th>
    <td>5</td><td>5</td><td>5</td><td>5</td><td>5</td>
    <td>5</td><td>4</td><td>5</td><td>5</td><td>5</td>
    <td>20</td><td align="left">10+9</td><td>5</td><td>5</td>
    <td>OK</td><th>98</th>    
  </tr>

  <tr><th>J</th>
    <td>5</td><td>5</td><td>5</td><td>5</td><td>5</td>
    <td>5</td><td>5</td><td>5</td><td>5</td><td>5</td>
    <td>20</td><td>10+10</td><td>5</td><td>5</td>
    <td>OK</td><th>100</th>
  </tr>
  
  <tr><th>M</th>
    <td>5</td><td>5</td><td>5</td><td>5</td><td>5</td>
    <td>5</td><td>4</td><td>5</td><td>5</td><td>5</td>
    <td>20</td><td align="center">9+9</td><td>5</td><td>5</td>
    <td>OK</td><th>97</th>
  </tr>

  <tr><th>P</th>
    <td>5</td><td>5</td><td>5</td><td>5</td><td>5</td>
    <td>5</td><td>4</td><td>5</td><td>5</td><td>5</td>
    <td>15</td><td align="center">9+9</td><td>5</td><td>4</td>
    <td>OK</td><th>91</th>    
  </tr>

  <tr><th>U</th>
    <td>5</td><td>5</td><td>5</td><td>5</td><td>5</td>
    <td>5</td><td>5</td><td>5</td><td>5</td><td>5</td>
    <td>20</td><td>10+10</td><td>5</td><td>5</td>
    <td>OK</td><th>100</th>
  </tr>
  
  <tr><th>T</th>
    <td>5</td><td>5</td><td>5</td><td>5</td><td>5</td>
    <td>5</td><td>4</td><td>5</td><td>5</td><td>5</td>
    <td>15</td><td>10+9</td><td>5</td><td>5</td>
    <td>OK</td><th>93</th>
    
  </tr>
</table>

</div>
<div id="pie">
  <hr noshade />
  Actualizado el 12 de mayo del 2022.
  <br>
  URL: https://satuelisa.github.io/method.html
</div>
</div>

</BODY>
</HTML>
