<!DOCTYPE HTML  PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3c.org/html4/HTML4-loose.dtd">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="content-language" content="en">
<TITLE>GR1 2010-2011 - Investigaci&oacute;n - Schaeffer</title>
<LINK rel="stylesheet" type="text/css" href="../../../elisa.principal.css">
</HEAD>
<BODY>
<div id="elementos">  
  <div id="navibar">
    <p>
      <a href="../../../espanol.html">Elisa Schaeffer</a> /
      <a href="../../espanol.html">Investigaci&oacute;n</a> / 
      GR 2010-2011
    </p>
  </div>
<div ID="contenido">
  <h1>Gran Reto 1</h1>
<h2>
Informaci&oacute;n relevante para la toma de decisiones</h2> 
<h3>De los datos a la informaci&oacute;n y al conocimiento</h3>


<p>
<table border="0" cellspacing="0" cellpadding="5">
<tr><th>Vigencia</th><td>06/2010-05/2011</td></tr>
<tr><th>Patrocinador</th>
<td><a href="http://www.conacyt.mx">CONACyT</a> / 
<a href="http://www.redtic-conacyt.mx/">Red TIC</a></td></tr>
<tr><th>Clave</th><td>GR1-2010</td></tr>
<tr><th>Monto</th><td>789,850 M.N.</td></tr>
<tr><th>LGAC</th>
<td>Modelado y optimizaci&oacute;n de sistemas adaptativos de informaci&oacute;n<br>
Dise&ntilde;o, desarrollo y evaluaci&oacute;n de sistemas adaptativos de informaci&oacute;n</td></tr>
</table>
</p>
<p>
<h3>Documentos</h3>
<p>
<ul>
<li><a href="gr1_2010.pdf">Propuesta</a></li>
</ul>
</p>
<h3>Resumen</h3>
<p>
El objetivo del proyecto es facilitar la recopilaci&oacute;n de datos
y la adopci&oacute;n sistem&aacute;tica de TI como herramienta de
apoyo para la toma de decisiones y su evaluaci&oacute;n, ayudando así
a la obtenci&oacute;n de conocimiento relevante, el cual tenga impacto
en la sociedad mexicana.
</p>
<p>
Los avances de la tecnolog&iacute;a de informaci&oacute;n que hemos
presenciado en los &uacute;ltimos a&ntilde;os son &uacute;nicamente
una parte de lo que se puede hacer con el c&uacute;mulo de datos que
existen en la telara&ntilde;a mundial de redes de computadoras. Hay
una parte sutil, pero sustancial, que aguarda por una
soluci&oacute;n. Hemos llegado a un punto en el que podemos tener
memorizada toda la actividad humana. El rango de las cosas que se
almacenan va desde un paseo por el parque donde se toman fotos y video
hasta la secuenciaci&oacute;n del ADN, datos astrof&iacute;sicos,
colisiones de part&iacute;culas elementales, tomograf&iacute;as,
placas radiol&oacute;gicas, seguido de un largo etc&eacute;tera.
</p>
<p>
El hecho de poder almacenar los datos no implica que tengamos
informaci&oacute;n de ellos. Del mismo modo, tener la
informaci&oacute;n no implica tener el conocimiento. Dado que esta se
tiene que organizar, sistematizar y vincular de manera tal que genere
el conocimiento que se necesita. Finalmente, el conocimiento nos
permite tomar decisiones. El desarrollar las tecnolog&iacute;as
necesarias para la generaci&oacute;n de conocimiento a partir de los
datos y apoyar a la toma de decisiones es el tema de este reto.</p>
<p>
Para el primer a&ntilde;o de trabajo, se plantean las siguientes metas en
relaci&oacute;n al dise&ntilde;o, an&aacute;lisis, desarrollo y aplicaci&oacute;n de sistemas de
informaci&oacute;n para apoyo la toma de decisiones:
<ul>
<li>Recopilar y documentar las &aacute;reas de expertise del grupo de trabajo.</li>
<li>Fomentar la colaboraci&oacute;n cient&iacute;fica dentro del grupo de trabajo.</li>  
<li>Documentar el estado del arte de las tecnolog&iacute;as disponibles y su
uso en M&eacute;xico.</li>  
<li>Recopilar y documentar las &aacute;reas de aplicaci&oacute;n de estas
tecnolog&iacute;as.</li>  
<li>Iniciar y fortalecer investigaci&oacute;n cient&iacute;fica y desarrollo
tecnol&oacute;gico nuevo en el &aacute;rea.</li>  
<li>Capacitar de forma continua los usuarios de los sistemas
desarrollados.</li>  
</ul>
<p>
En particular es importante la integraci&oacute;n trilateral de la
informaci&oacute;n, las herramientas y su aprovechamiento en el contexto de
la sociedad. A plazo mediano, se espera poder escalar las metas de
corto plazo a mayor alcance e impacto. Es de importancia que se logre
aterrizar los avances logrados en el trabajo en la sociedad mexicana
antes de concluir los primeros cinco a&ntilde;os del esfuerzo del reto.
<ul>
<li>Actualizar de forma continua la documentaci&oacute;n de las &aacute;reas de
expertise.</li>  
<li>Actualizar de forma continua la documentaci&oacute;n de las &aacute;reas
de aplicaci&oacute;n.</li>  
<li>Consolidar la colaboraci&oacute;n interinstitucional con
proyectos financiados.</li>  
<li>Avanzar el estado del arte de investigaci&oacute;n y
desarrollo.</li>  
<li>Dise&ntilde;ar y documentar procedimientos para apoyo a la toma
de decisiones.</li>  
<li>Dise&ntilde;ar mecanismos de evaluaci&oacute;n del impacto de las
decisiones tomadas.</li>  
<li>Dise&ntilde;ar, desarrollar y proporcionar arquitecturas
y herramientas tecnol&oacute;gicas.</li>  
<li>Facilitar la adopci&oacute;n e integraci&oacute;n de
arquitecturas y herramientas tecnol&oacute;gicas.</li>  
<li>Ofrecer materiales, cursos
y consultor&iacute;a para la capacitaci&oacute;n los usuarios.</li>
</ul>
</p>
<p>
En lo siguiente se detallan las seis (6) acciones que tomar&aacute; el grupo
de trabajo para atender el reto identificado y sus entregables para el
primer a&ntilde;o. 
<ol>
<li><strong>Mapeo de expertise a las fases de toma de
decisiones</strong><br> La primera acci&oacute;n abarca la realizaci&oacute;n y
documentaci&oacute;n de un censo de &aacute;reas de expertise de los participantes
del Reto. Esta informaci&oacute;n se documentar&aacute; y har&aacute; disponible de forma
p&uacute;blica con el fin de promover y facilitar la comunicaci&oacute;n constante
entre los expertos y la comunidad.</li>


<li><strong>
Identificaci&oacute;n de &aacute;reas de aportaciones potenciales de cada participante, 
</strong><br>La segunda acci&oacute;n abarca como actividades la definici&oacute;n
de las &aacute;reas de inter&eacute;s a nivel de ciencia b&aacute;sica de los participantes
del Reto. Esto se lleva a cabo en una plataforma Wiki en la cual
pueden proporcional datos los participantes de forma colaborativa,
apoyado donde necesario por encuestas y cuestionarios. En una segunda
fase, al haber mapeado los participantes a los distintos aspectos
cient&iacute;ficos y tecnol&oacute;gicos del Reto, se procede al mapeo de las
colaboraciones existentes a nivel internacional e internacional, con
el fin de identificar &aacute;reas de inter&eacute;s com&uacute;n y posibles sinerg&iacute;as a
nivel nacional. Se busca fomentar la interacci&oacute;n con entidades
gubernamentales con el fin de conseguir fondos externos para financiar
las colaboraciones.</li>


<li><strong>Mapeo del estado del arte de la investigaci&oacute;n en
M&eacute;xico</strong><br>La tercera acci&oacute;n propuesta es la realizaci&oacute;n de un
an&aacute;lisis del estado del arte a nivel nacional Las actividades
particulares son llenado del Wiki por los participantes con su
producci&oacute;n cient&iacute;fica. Esto producir&aacute; informaci&oacute;n adicional tambi&eacute;n
para la segunda acci&oacute;n. El an&aacute;lisis incluye los trabajos de los
participantes mismos y tambi&eacute;n los de investigadores externos al
grupo.</li>

<li><strong>Mapeo de &aacute;rea de aplicaci&oacute;n y potenciales vinculaciones
con pertinencia nacional</strong><br>En la cuarta acci&oacute;n, apoy&aacute;ndose
en los resultados de las tres acciones ya planteadas, sigue el
an&aacute;lisis del potencial de vinculaci&oacute;n de los integrantes del Gran Reto
1 con entidades del sector p&uacute;blico y privado en M&eacute;xico, para la
aplicaci&oacute;n de sus &aacute;reas de expertise en la soluci&oacute;n de problemas y
satisfacci&oacute;n de necesidades de TI, relacionadas con el manejo de
datos, informaci&oacute;n y conocimiento en apoyo a la toma de decisiones en
las organizaciones mexicanas.</li>

<li><strong>Taller de investigaci&oacute;n</strong><br> La quinta acci&oacute;n es
la organizaci&oacute;n de un taller. El objetivo principal del taller de
investigaci&oacute;n ser&aacute; el de proporcionar un foro de participaci&oacute;n tanto
para los investigadores integrantes del Reto, como para aquellos
estudiantes tesistas de licenciatura y posgrado relacionados con la
tem&aacute;tica del GR1. Se espera que los participantes presenten avances y
contribuciones relacionadas con el tratamiento de informaci&oacute;n y la
toma de decisiones. Tales contribuciones deber&iacute;a de provenir de los
proyectos de investigaci&oacute;n activos y trabajos de tesis respectivos.</li>


<li><strong>Dise&ntilde;o y producci&oacute;n de material educacional</strong><br>
La sexta acci&oacute;n abarca el tema de educaci&oacute;n continua de usuarios de
los sistemas desarrollados. &Aacute;reas de inter&eacute;s particular incluyen las
interfaces y procedimientos en el registro de datos igual como las
interfaces y procedimientos en la utilizaci&oacute;n de informaci&oacute;n extra&iacute;da.
En el primer a&ntilde;o se organiza la producci&oacute;n de tal material e
identifica temas necesarios para cubrir con el material y el p&uacute;blico
usuario del mismo. Se inicia con el dise&ntilde;o de un curso piloto dirigido
al sector p&uacute;blico sobre registro de datos y toma de decisiones con
sistemas de informaci&oacute;n.  En el largo plazo, se generar&aacute;n dichos
materiales educativos (v&iacute;deos, art&iacute;culos) para difundir el
conocimiento generado en el grupo de trabajo. El material educativo se
genera a partir del segundo a&ntilde;o.  Se contempla la posibilidad de
n&uacute;meros especiales en este tem&aacute;tica en revistas nacionales (en el
segundo a&ntilde;o) y la publicaci&oacute;n de algunas materiales en l&iacute;nea.
</li>
</ol>
</p>


<h3>Participantes y l&iacute;neas de investigaci&oacute;n</h3>
<p>
Las instituciones participantes en el Reto son las
siguientes: 
<ol>
<li>Instituto Polit&eacute;cnico Nacional (IPN)</li>
<li>Centro de
Investigaci&oacute;n y Desarrollo de Tecnolog&iacute;a Digital (CITEDI)</li>
<li>Universidad
Aut&oacute;noma de Nuevo Le&oacute;n (UANL)</li>
<li>Instituto Tecnol&oacute;gico de Estudios
Superiores de Monterrey (ITESM) Campus Monterrey (MTY)</li>
<li>Instituto
Nacional de Astrof&iacute;sica, Optica y Electr&oacute;nica (INAOE)</li>
<li>Universidad
Michoac&aacute;n de San Nicol&aacute;s de Hidalgo (UMSNH)</li>
<li>Benem&eacute;rita Universidad
Aut&oacute;noma de Puebla (BUAP)</li>
<li>Instituto Mexicano del Petr&oacute;leo (IMP)</li>
<li>Instituto Tecnol&oacute;gico de Hermosillo (ITH)</li>
<li>Laboratorio Franco-Mexicano
de Inform&aacute;tica y Autom&aacute;tica (LAFMIA)</li>
<li>Universidad Nacional Aut&oacute;noma de
M&eacute;xico (UNAM)</li>
<li>Universidad Aut&oacute;noma de Quer&eacute;taro (UAQ)</li>
<li>Instituto
Tecnol&oacute;gico de Puebla (ITP)</li>
<li>Centro de Investigaci&oacute;n y de Estudios Avanzados del IPN (CINVESTAV)
Unidad Tamaulipas (Tamps.)</li>
<li> The Business Intelligence Institute (TBII)</li>
<li>Laboratorio Nacional de Inform&aacute;tica Avanzada (LANIA)</li>
<li> Universidad de
las Am&eacute;ricas Puebla (UDLAP)</li>
</ol>
<p>
Las siguientes investigadores de la Red TIC participan en el proyecto
de GR1, ordenados por la l&iacute;nea de investigaci&oacute;n principal del
participante.
<ul>
<li>Bases de datos
<ol>
<li>Lorena G. G&oacute;mez Mart&iacute;nez, ITESM MTY</li>
<li>H&eacute;ctor Javier Franco Beltr&aacute;n, TBII</li>
<li>Karina Mariela Figueroa Mora, UMSNH</li>
<li>Genoveva Vargas Solar, LAFMIA</li>
<li>Mar&iacute;a Trinidad Serna Encinas, ITH</li>
<li>Oscar Mario Rodr&iacute;guez Elias, ITH</li>
<li>V&iacute;ctor Jes&uacute;s Sosa Sosa, CINVESTAV Tamps.</li>
<li>Ofelia Delfina Cervantes Villag&oacute;mez, UDLAP</li>
<li>Edgar Leonel Ch&aacute;vez Gonz&aacute;lez, UMSNH</li>
</ol>
</li>
<li>Tecnolog&iacute;as del lenguaje y el conocimiento
<ol>
<li>Mar&iacute;a de la Concepci&oacute;n P&eacute;rez de Celis Herrero, BUAP</li>
<li>David Eduardo Pinto Avenda&ntilde;o, BUAP</li>
<li>Luis Villase&ntilde;or Pineda, INAOE</li>
<li>Gerardo Sierra Mart&iacute;nez, UNAM</li>
<li>C&eacute;sar Antonio Aguilar, UAQ</li>
<li>Alfonso Medina Urrea, UNAM</li>
<li>Pilar Vidriales, IMP</li>
<li>Jos&eacute; Mitre Silva, IMP</li>
</ol></li>
<li>Aprendizaje y c&oacute;mputo suave
<ol>
<li>Mar&iacute;a Luisa Saavedra Garc&iacute;a, UNAM</li>
<li>Mar&iacute;a del Pilar G&oacute;mez Gil, INAOE</li>
<li>Leonid Sheremetov, IMP</li>
<li>Eduardo Morales Manzanares, INAOE</li>
<li>Manuel Romero Salcedo, IMP</li>
<li>Efr&eacute;n Mezura Montes, LANIA</li>
<li>Jes&uacute;s Antonio Gonz&aacute;lez Bernal, INAOE</li>
</ol>
<li>Redes y comunicaciones
<ol>
<li>Mireya Sara&iacute; Garc&iacute;a V&aacute;zquez, IPN-CITEDI</li>
<li>Paolo Bucciol, LAFMIA</li>
<li>Alejando &Aacute;lvaro Ram&iacute;rez Acosta, IPN-CITEDI</li>
</ol>
</li>
<li>Sistemas ubicuos multiagente
<ol>
<li>Satu Elisa Schaeffer, UANL</li>
<li>Jos&eacute; Bernardo Parra Victorino, ITP</li>
</ol>
</li>
</ul>
Contamos con un (1) investigador participante quien es externo a la
Red Tem&aacute;tica. Se asocia a la l&iacute;nea de Bases de datos: Jos&eacute; Luis
Zechinelli Martini de LAFMIA /UDLAP.</p>
</p>
<h3>Productos</h3>
<p>
El proyecto todav&iacute;a no ha concluido.
</p>

</div>
<div id="pie">
Actualizada la &uacute;ltima vez el 5 de octubre del 2010. <br/>
URL: http://elisa.dyndns-web.com/~elisa/research/projects/conacyt/gr1_2010.html 
</div>
</div>

</BODY>
</HTML>



