<!DOCTYPE HTML>
<HTML lang="es">
  <HEAD>
    <META HTTP-EQUIV="Content-Type" content="text/html; charset=UTF-8">
    <title>Simulaci&oacute;n &mdash; Schaeffer</title>    
    <LINK rel="stylesheet" type="text/css" href="paralelo.css">
  </head>
  <body>
    <h1>Simulaci&oacute;n</h1>
    <p>
      Simulaci&oacute;n refiere a la reproducci&oacute;n
      (computacional) de fen&oacute;menos y procesos del mundo
      real. T&iacute;picamente involucra primero el modelado de dicho
      proceso o fen&oacute;meno a trav&eacute;s de experimentos
      estad&iacute;sticos. Despu&eacute;s la reproducci&oacute;n
      involucra la generaci&oacute;n pseudo-aleatoria para crear los
      modelos en el ambiente simulado. Sus aplicaciones son numerosas
      en temas cient&iacute;ficos, industriales, de
      construcci&oacute;n, de la salud, evacuaciones,
      etc&eacute;tera. Las epidemias son particularmente interesantes
      de estudiar con simulaciones.  El an&aacute;lisis de elemento
      finito (FEM) para aspectos estructurales es muy parecido a la
      simulaci&oacute;n; se extrapola el comportamiento de una entidad
      a trav&eacute;s de un modelo que lo parte a una cantidad
      discreta de elementos peque&ntilde;os de comportamiento ya
      modelado. La simulaci&oacute;n tambi&eacute;n est&aacute;
      presente en el entretenimiento (pel&iacute;culas y videojuegos)
      en la creaci&oacute;n de ambientes virtuales y efectos.
    </p>
    <p>
      Las computadoras modernas ya cuentan con m&aacute;s de un
      n&uacute;cleo de procesamiento y adem&aacute;s es f&aacute;cil
      para una organizaci&oacute;n aprovechar de manera
      simult&aacute;nea el poder computacional de m&aacute;s de una
      computadora al enfrentar un problema cuya soluci&oacute;n
      requiere una cantidad elevada de recursos. Sin embargo, las
      t&eacute;cnicas t&iacute;picas de procesamiento de datos que uno
      aprende al comenzar a programar no son capaces de aprovechar los
      recursos de m&aacute;s que un n&uacute;cleo a la vez.
      La <em>programaci&oacute;n <strong>paralela</strong></em>
      refiere al dise&ntilde;o y la implementaci&oacute;n de
      m&eacute;todos de procesamiento que buscan utilizar dos o
      m&aacute;s n&uacute;cleos &mdash; o hasta todos los disponibles
      en un momento dado &mdash; para repatir el trabajo entre los
      n&uacute;cleos con el prop&oacute;sito de disminuir el tiempo de
      reloj requerido para llevar a cabo la tarea en cuesti&oacute;n.
    </p>
    <p>
      En este curso se realizan actividades de aprendizaje que
      permiten la paralelizaci&oacute;n de algunas tareas
      fundamentales de an&aacute;lisis y procesamiento de datos en los
      lenguajes R y Python, desde m&aacute;s sencillos hasta
      m&aacute;s complejos, para que el participante pueda en sus
      trabajos futuros identificar oportunidades de
      paralelizaci&oacute;n y dominar las t&eacute;cnicas
      b&aacute;sicas de llevarlo a cabo con elegancia y eficiencia. Se
      implementan diversas simulaciones computacionales para generar y
      analizar informaci&oacute;n de distintos tipos. Si alg&uacute;n
      participante quiere realizar las pr&aacute;cticas en un lenguaje
      emergente distinto como por ejemplo Julia, esto se permite con
      que el participante informe previamente a la profesora y acepte
      que no habr&aacute; ejemplos disponibles en otros lenguajes.
    </p>
    <h2>Temario</h2>
    <yl>
    <li>Introducci&oacute;n (semana  1)
      <ul>
	<li><a href="tutorial/R.html">R</a></li>
	<li><a href="tutorial/Python.html">Python</a></li>
      </ul>
    </li>
    <li>Medici&oacute;n de desempe&ntilde;o computacional (semana 2)
      <ul>
	<li><a href="medicion/R.html">R</a></li>
	<li><a href="medicion/Python.html">Python</a></li>
      </ul>
    </li>
    <li>C&oacute;mputo paralelo en CPU y GPU (semana 3)
      <ul>
	<li><a href="paralelo/R.html">R</a></li>
	<li><a href="paralelo/Python.html">Python</a></li>
      </ul>
    </li>
    <li><a href="p1.html">Pr&aacute;ctica 1: movimiento
      Browniano</a> (semana 4)</li>
      <li><a href="p2.html">Pr&aacute;ctica 2: aut&oacute;mata celular</a> (semana 5)</li>
      <li><a href="p3.html">Pr&aacute;ctica 3: teor&iacute;a de colas</a> (semana 6)</li>
      <li><a href="p4.html">Pr&aacute;ctica 4: diagramas de Voronoi</a> (semana 7)</li>
      <li><a href="p5.html">Pr&aacute;ctica 5: m&eacute;todo Monte-Carlo</a> (semana 8)</li>
      <li><a href="p6.html">Pr&aacute;ctica 6: sistema multiagente</a> (semana 9)</li>
      <li><a href="p7.html">Pr&aacute;ctica 7: b&uacute;squeda local</a> (semana 10)</li>
      <li><a href="p8.html">Pr&aacute;ctica 8: modelo de urnas</a> (semana 11)</li>
      <li><a href="p9.html">Pr&aacute;ctica 9: interacciones entre part&iacute;culas</a> (semana 12)</li> 
    <li><a href="p10.html">Pr&aacute;ctica 10: algoritmo gen&eacute;tico</a> (semana 13)</li>
      <li><a href="p11.html">Pr&aacute;ctica 11: frentes de Pareto</a> (semana 14)</li>
    <li><a href="p12.html">Pr&aacute;ctica 12: red neuronal</a> (semana 15)</li>
    <li>Registro de temas del <a href="proyecto.html">proyecto integrador</a> (semana 16)</li> 
      <li>Avances del <a href="proyecto.html">proyecto integrador</a> (semanas 17 y 18)</li>
    <li>Presentaciones de <a href="proyecto.html">proyecto integrador</a> (semana 19)</li>
      <li>Entrega de portafolios de evidencia y llenado de la encuesta docente (semana 20)</li>
      <li><a href="biblio.html">Bibliograf&iacute;a</a></li>
    </ul>
    <p>
      <small>
	Este sitio web ha sido preparado para ser utilizado con el
	navegador
	<a href="https://www.google.com/chrome/browser/desktop/">Google
	  Chrome</a>.  Contacten a
	la <a href="../">profesora</a> si
	tienen problemas en su uso; en el caso de reporte error, favor
	de incluir captura de pantalla del error para agilizar su
	correcci&oacute;n.
      </small>
    </p>
    <hr>
    <h3>
      <a href="resultados.html">Criterios de calificaci&oacute;n y resultados</a>
    </h3>
<hr>
    <div>
	Actualizado el 4 de agosto del 2021.<br>
	<code>https://satuelisa.github.io/</code>
    </div>
  </body>
</html>
