<!DOCTYPE HTML>
<HTML lang="es">
  <HEAD>
    <META HTTP-EQUIV="Content-Type" content="text/html;
					     charset=UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Proyecto &mdash; R paralelo &mdash; Schaeffer</title>
    
    <LINK rel="stylesheet" type="text/css" href="paralelo.css">

    <link rel="stylesheet" href="syntax/styles/shCore.css" type="text/css" />
    <link rel="stylesheet" href="syntax/styles/shThemeRDark.css" type="text/css" />
    <script type='text/javascript' src='syntax/scripts/shCore.js'></script>
    <script type='text/javascript' src='syntax/scripts/shAutoloader.js'></script>

  </head>

  
  <body>
    <p align="right">
      <a href="index.html">R paralelo: simulaci&oacute;n &amp;
      an&aacute;lisis de datos</a>
    </p>

    <h2>Proyecto integrador</h2>

    <p>
      Cada participante, una vez concluida su participaci&oacute;n en
      las tareas, propone un tema de proyecto a la profesora. Una vez
      iniciado el proyecto, ya no se permite entregar tareas
      adicionales &ndash; los participantes pueden iniciar el proyecto
      cuando consideran que ya no necesitan tareas adicionales ni para
      aprendizaje ni para aprobar el curso (se recomienda agendar por
      lo menos dos semanas de trabajo para el proyecto y un buen
      proyecto puede requerir hasta un mes; no se permite iniciar
      proyecto con menos de 50 puntos acumulados de las tareas). No
      se permite iniciar trabajos sobre el proyecto antes de haber
      obtenido el permiso expl&iacute;cito de la profesora; es
      necesario que ella valide que el tema propuesto cubra los
      aspectos requeridos del proyecto y que su complejidad no es ni
      demasiado baja para un curso de este nivel ni demasiado alta
      para poder completarse durante el curso. El proyecto debe
      entregarse a la profesora antes de que termine el periodo de
      curso, por lo menos tres d&iacute;as h&aacute;biles antes de que
      ella tenga que capturar las calificaciones (la fecha exacta
      depende del departamento escolar).
    </p>
    <p>
      Todos los proyectos deben tener la siguiente estructura general:
    </p>
      <ol>
	<li>Se identifica un fen&oacute;meno de inter&eacute;s en el &aacute;rea de trabajo
	  o estudio o hasta alguna afici&oacute;n del participante del cual
	  el participante tiene o puede obtener datos verdaderos.</li>
	<li>Se analizan y visualizan los datos verdaderos para
	  caracterizar su naturaleza con el fin de poder proponer
	  modelos explicativos a ello.</li>
	<li>Se implementa una simulaci&oacute;n, basado en el modelo
	  propuesto, que imite el fen&oacute;meno de inter&eacute;s en algunos
	  aspectos que se consideran relevantes.</li>
	<li>Se analizan los datos generados por la simulaci&oacute;n para
	  determinar si se ha alcanzado una similitud adecuada entre los
	  datos verdaderos y los datos simulados.</li>
	<li>Se estudia el desempe&ntilde;o computacional de la simulaci&oacute;n
	  implementada.</li>
      </ol>
    <p>
      El reporte del proyecto se estructura como un art&iacute;culo
      cient&iacute;fico, contando con un t&iacute;tulo, autores, un resumen y
      secciones para introducci&oacute;n, antecedentes, trabajos
      relacionados, modelo propuesto, implementaci&oacute;n de la simulaci&oacute;n,
      experimentos (dise&ntilde;o, resultados y discusi&oacute;n), conclusiones y
      trabajo a futuro. Es obligatorio incluir una bibliograf&iacute;a y
      citar de manera adecuada a todas las fuentes de consulta. 
    </p>
    <h3>Criterios de calificaci&oacute;n</h3>
    <p>
      El proyecto otorga hasta 30 puntos hacia la calificaci&oacute;n final,
      tomando en cuenta la extensi&oacute;n y la calidad de los siguientes
      aspectos, cada una en escala de 0&dash;5. 
    </p>
    <ul>
      <li><strong>Complejidad del problema</strong> &mdash; problemas
	retadores se califican m&aacute;s generosamente que problemas
	sencillos.</li>
      <li><strong>Fidelidad de la simulaci&oacute;n</strong> &mdash; la
	incorporaci&oacute;n exitosa de m&uacute;ltiples aspectos del fen&oacute;meno
	estudiado dentro de la simulaci&oacute;n otorga una mayor cantidad de
	puntos que modelos simplificados o poco realistas.</li>
      <li><strong>Visualizaci&oacute;n de la informaci&oacute;n</strong> &mdash; el
	uso de m&eacute;todos diversos e informativos para graficar los datos
	(ambos los originales y los generados por la simulaci&oacute;n, igual
	como datos de desempe&ntilde;o de la misma simulaci&oacute;n) es premiado en
	la calificaci&oacute;n.</li>
      <li><strong>An&aacute;lisis estad&iacute;stico</strong> &mdash; aplicaci&oacute;n de
	m&eacute;todos rigurosos de examinaci&oacute;n estad&iacute;stica, su selecci&oacute;n
	adecuada y su interpretaci&oacute;n correcta otorgan m&aacute;s puntos que el
	mero uso de medidas triviales o la ausencia total de an&aacute;lisis
	estad&iacute;stico formal.</li>
      <li><strong>Grado y utilidad de paralelismo</strong> &mdash; la
      eficiente paralelizaci&oacute;n de todo lo que se pueda paralelizar sin
      p&eacute;rdida de eficiencia es altamente deseable; tambi&eacute;n se aprecian
      comparasiones de desempe&ntilde;o entre versiones con y sin paralelismo
      igual como el efecto del n&uacute;mero de n&uacute;cleos disponibles.</li>
      <li><strong>Claridad y calidad de la redacci&oacute;n</strong>
      &mdash; ortograf&iacute;a, gram&aacute;tica, puntuaci&oacute;n, posicionamiento y
      formato de ecuaciones, cuadros y figuras, estructuraci&oacute;n de
      frases, p&aacute;rrafos, secciones, organizaci&oacute;n de la discusi&oacute;n, igual
      como el formato y la extensi&oacute;n de la bibliograf&iacute;a entran en
      juego al calificar la calidad de un manuscrito.</li>
    </ul>

    <div>
      <center>
	Actualizado el 31 de enero del 2022.<br>
	<code>https://satuelisa.github.io/proyecto.html</code>
      </center>
    </div>
    <script type="text/javascript">
      SyntaxHighlighter.autoloader(
      "r  syntax/scripts/shBrushR.js",
      );
      SyntaxHighlighter.defaults["toolbar"] = false;
      SyntaxHighlighter.all();
    </script>
  </body>
</html>
