
<!DOCTYPE HTML  PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3c.org/html4/HTML4-loose.dtd">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="content-language" content="en">
<TITLE>PROMEP 2007-2009 - Investigaci&oacute;n - Schaeffer</title>
<LINK rel="stylesheet" type="text/css" href="../../../elisa.principal.css">
</HEAD>
<BODY>
<div id="elementos">  
  <div id="navibar">
    <p>
      <a href="../../../espanol.html">Elisa Schaeffer</a> /
      <a href="../../espanol.html">Investigaci&oacute;n</a> / 
      PROMEP 2007-2009
    </p>
  </div>
<div ID="contenido">
<h1>PROMEP 2007-2009</h1>
<h2>B&uacute;squeda adaptiva en redes din&aacute;micas masivas</h2>

<p>
<table border="0" cellspacing="0" cellpadding="5">
<tr><th>Vigencia</th><td>11/2007-11/2009</td></tr>
<tr><th>Patrocinador</th><td>
SEP-<a href="http://promep.sep.gob.mx/">PROMEP</a>
<tr><th>Clave</th><td>
103,5/07/2523<br>
103,5/08/4804
</td></tr>
<tr><th>Monto</th><td>206,224 M.N.</td></tr>
<tr><th>LGAC</th>
<td>Modelado y optimizaci&oacute;n de sistemas adaptativos de informaci&oacute;n<br>
Dise&ntilde;o, desarrollo y evaluaci&oacute;n de sistemas adaptativos de informaci&oacute;n</td></tr>
</table>
</p>
<p>
<h3>Documentos</h3>
<p>
<ul>
<li><a href="promep_2007.pdf">Propuesta de 1er a&ntilde;o</a></li>
<li><a href="promep_2008.pdf">Propuesta de 2do a&ntilde;o</a></li>
<li><a href="promep_informe.pdf">Informe final</a></li>
</ul>
</p>
<h3>Resumen</h3>
<p>
Estudiamos redes din&aacute;micas de tama&ntilde;o masivo, como los
sistemas entre pares y s&uacute;percomputadoras formadas por numerosos
equipos peque&ntilde;os que colaboren para lograr coordinaci&oacute;n
entre ellos. Nuestro enfoque est&aacute; en los algoritmos de
b&uacute;squeda distribuida de comportamiento escalable y
din&aacute;mica que no sufren del crecimiento del sistema ni de
cambios de topolog&iacute;a. La importancia de tal estudio proviene
del papel importante que ya han obtenido redes de informaci&oacute;n y
comunicaci&oacute;n en la sociedad moderna. La relevancia del proyecto
est&aacute; en dise&ntilde;ar soluciones capaces de reaccionar a
patrones de uso del sistema y as&iacute; evolucionar seg&uacute;n los
cambios de comportamiento y intereses de los usuarios. Queremos crear
algoritmos adaptivos que aprendan del tr&aacute;fico en la red y
utilicen sus observaciones para mejorar la calidad de servicio a los
b&uacute;squedas futuras. Utilizamos los descubrimientos de la
&uacute;ltima d&eacute;cada sobre redes naturales y sistemas complejos para
desarrollar m&eacute;todos refinados en especial para instancias reales. El
trabajo ser&aacute; anal&iacute;tico y experimental. El grupo de
trabajo ya tiene colaboraci&oacute;n establecida sobre el tema y
fuertes conocimientos del dise&ntilde;o y an&aacute;lisis de
algoritmos, experimentos computacionales y simulaci&oacute;n.
</p>
<h3>Participantes</h3>
<p>
<ul>
<li>Investigadores
<ul>
<li><a href="../../../espanol.html">Dra. Elisa Schaeffer</a></li>
<li><a href="http://it.ciidit.uanl.mx/~arturo/">Dr. J. Arturo Berrones Santos</a>, FIME, UANL</li>
</ul>
</li>
<li>Colaboradores
<ul>
<li><a href="http://www.tcs.hut.fi/~orponen/">Dr. Pekka Orponen</a>,
Universidad Polit&eacute;cnica de Helsinki (TKK), Finlandia</li>
<li>Dra. Laura Cruz Reyes, ITCM</li>
<li><a href="http://weblogs.inf.udp.cl/javierbustos">Dr. Javier Bustos Jim&eacute;nez</a>, UDP, Chile</li>
</ul>
</li>
<li>Estudiantes
<ol>

<li><a href="../../../students/espanol.html#ingcastillo2009">Sr. 
Carlos Alberto Castillo Salazar 
- tesis de licenciatura</a> principalmente asociado al proyecto, concluida en octubre 2009</li>

<li><a href="../../../students/espanol.html#mcrios2009">Ing. 
David Juvencio Rios Soria
- tesis de maestr&iacute;a</a> principalmente asociado al proyecto, concluida en julio 2009</li>

<li><a href="../../../students/espanol.html#mcavalos2009">Lic.
Vanesa Avalos Gayt&aacute;n - tesis de maestr&iacute;a</a>
parcialmente asociado al proyecto, concluida en febrero 2009;
inici&oacute;o sus estudios de doctorado</li>

<li><a href="../../../students/espanol.html#mccantu2009">Ing. 
Perla Cant&uacute; Cerda 
- tesis de maestr&iacute;a</a> parcialmente asociado al proyecto, concluida en octubre 2009</li>

<li><a href="../../../students/espanol.html#mcaguirre2008">Ing.
Marco Antonio Aguirre Lam - tesis de maest&iacute;a</a> (externo,
ITCM) principalmente asociado al proyecto, concluida en diciembre
2008</li>

<li><a href="../../../students/espanol.html#mcrivera2009">Ing.
Gilberto Rivera Zarate
- tesis de maest&iacute;a</a> (externo,
ITCM) principalmente asociado al proyecto, concluida en diciembre
2009</li>

<li><a href="../../../students/espanol.html#mcquiroz2009">Ing.
Marcela Quiroz Castellanos
- tesis de maest&iacute;a</a> (externo,
ITCM) parcialmente asociado al proyecto, concluida en diciembre 2009</li>

<li>M.C. Claudia Guadalupe G&oacute;mez Santill&aacute;n - tesis de
doctorado (externo) principalmente asociado al proyecto, concluida en diciembre 2009</li>

<li>Lic. Nidia Lizett G&oacute;mez Duarte - tesis de maestr&iacute;a
en proceso, parcialmente asociado al proyecto</li>

<li>M.C. Tania Turrubiates L&oacute;opez - tesis de doctorado en
proceso, parcialmente asociado al proyecto</li>

</ol>
</li>
</ul>
</p>
<h3>Productos</h3>
<h4>Publicaciones: revistas, cap&iacute;tulos, memorias e informes t&eacute;cnicos</h4>
<ol>
<li>Vanesa Avalos Gayt&aacute;n, Mario Rivera Ram&iacute;rez y Elisa
Schaeffer. Agrupamiento local en grafos dirigidos. Ciencia UANL,
XII(3): 281-287, 2009. ISSN 1405-9177.</li>
<li>Claudia Guadalupe G&oacute;mez Santill&aacute;n, Laura Cruz Reyes, Eustorgio
Meza, Tania Turrubiates L&oacute;pez, Marco A. Aguirre Lam y Satu Elisa
Schaeffer. Improving Distributed Resource Search through a Statistical
Methodology of Topological Feature Selection. Journal of Computers,
Special Issue on Trends in Hybrid Intelligent Systems, 4(8): 727-733,
agosto 2009.</li>
<li>Laura Cruz Reyes, Claudia Guadalupe G&oacute;mez Santill&aacute;n, Marco Antonio
Aguirre Lam, Satu Elisa Schaeffer, Tania Turrubiates L&oacute;pez, Rogelio
Ortega Izaguirre y H&eacute;ctor J. Fraire Huacuja. NAS Algorithm for
Semantic Query Routing Systems in Complex Networks. En Advances in
Soft Computing, Volumen 50/2009, pp. 284-292, Springer Verlag.</li>
<li>Perla Elizabeth Cant&uacute; Cerda y Satu Elisa Schaeffer. An&aacute;lisis y
optimizaci&oacute;n estructural de redes complejas. En Memorias del Sexto
Congreso Internacional Sobre Innovaci&oacute;n y Desarrollo Tecnol&oacute;gico
(CIINDET 2008), Morelos, M&eacute;xico, octubre del 2008, IEEE.</li>
<li>Laura Cruz Reyes, Claudia Guadalupe G&oacute;mez Santill&aacute;n, Marco Antonio
Aguirre Lam, Satu Elisa Schaeffer, Tania Turrubiates L&oacute;pez y Rogelio
Ortega Izaguirre. Comparative Study of Search Processes in Algorithms
for Semantic Query Routing Systems in Complex Networks. En Proceedings
of the Fifteenth International Conference on Advanced Computer
Systems, Artificial Intelligence, Software Technologies, Biometrics,
and Information Technology Security; International Conference on
Advanced Computer Systems (ACS-AISBIS 2008).</li>
<li>Satu Elisa Schaeffer. Computaci&oacute;n aleatorizada - probabilidad y
algoritmos. RISCE - Revista Internacional de Sistemas Computacionales
y Electr&oacute;nicos. ESCOM IPN, No. 0, pp. 2-5, enero 2009. ISSN en
tr&aacute;mite.</li>
<li>Pekka Orponen, Satu Elisa Schaeffer y Vanesa Avalos
Gayt&aacute;n. Locally computable approximations for spectral clustering and
absorption times of random walks. Informe t&eacute;cnico arXiv:0810.4061
[cs.DM], arXiv.org, octubre 2008.</li>
</ol>
<h4>Trabajos presentados sobre el tem&aacute;tica del proyecto</h4>
<ol>
<li>Dra. Elisa Schaeffer present&oacute; la conferencia magistral
Optimizaci&oacute;n Estructural de Redes en el Noveno Congreso de Ingenier&iacute;a
Industrial del Instituto Tecnol&oacute;gico de Culiac&aacute;n en Sinaloa en marzo
del 2009.</li>
<li>Lic. Nidia G&oacute;mez Duarte y M.C. Vanesa Avalos Gayt&aacute;n
presentaron el cartel An&aacute;lisis y sincronizaci&oacute;n de
sistemas cooperativos de robots m&oacute;viles en la XIX Escuela
Nacional de Optimizaci&oacute;n y An&aacute;lisis Num&eacute;rico en
marzo del 2009 en la Facultad de Ciencias F&iacute;sico
Matem&aacute;ticas de la Benem&eacute;rita Universidad Aut&oacute;noma
de Puebla.</li>
<li>M.C. Vanesa Avalos Gayt&aacute;n present&oacute; la ponencia
Agrupamiento loca en grafos dirigidos en la XIX Escuela Nacional de
Optimizaci&oacute;n y An&aacute;lisis Num&eacute;rico en marzo del
2009 en la Facultad de Ciencias F&iacute;sico Matem&aacute;ticas de la
Benem&eacute;rita Universidad Aut&oacute;noma de Puebla.</li>
<li>Dra. Elisa Schaeffer present&oacute; la ponencia Redes sensoras -
Tecnolog&iacute;a, desafios y aplicaciones en el Seminario de
Investigaci&oacute;n de CINVESTAV Monterrey en mayo del 2009.</li>
<li>Dra. Elisa Schaeffer present&oacute; la ponencia Sincronizaci&oacute;n y
Coordinaci&oacute;n Rob&oacute;tica para Tareas Colaborativas en el Seminario de
Investigaci&oacute;n de CINVESTAV Tamaulipas en junio del 2009.</li>
<li>Dra. Elisa Schaeffer present&oacute; la conferencia magistral
Coordinaci&oacute;n en Sistemas Multiagentes en el Congreso Nacional e
Internacional de Inform&aacute;tica y Sistemas Computacionales (CONAIS 2009)
en Villahermosa en septiembre del 2009.</li>
<li>Dra. Elisa Schaeffer present&oacute; la conferencia magistral Sistemas
adaptativos inteligentes en el Sexto Congreso Internacional de
Ingenieria en Computaci&oacute;n, Centro Universitario de Ixtlahuaca en
octubre del 2009.</li>
<li>Dra. Elisa Schaeffer present&oacute; en ingl&eacute;s la ponencia Sensor
Networks en el Seminario de Doctorado en ITESM Monterrey en Monterrey
en octubre del 2009.</li>
<li>Dra. Elisa Schaeffer present&oacute; la ponencia Sincronizaci&oacute;n y
coordinaci&oacute;n en sistemas multiagentes en el Seminario de Inteligencia
Artificial en la Universidad Regiomontana (UR) en Monterrey en octubre
del 2009.</li>
</p>

</div>
<div id="pie">
Actualizada la &uacute;ltima vez el 5 de octubre del 2010. <br/>
URL: http://elisa.dyndns-web.com/~elisa/research/projects/promep/promep.html
</div>
</div>

</BODY>
</HTML>

