
<!DOCTYPE HTML  PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3c.org/html4/HTML4-loose.dtd">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="content-language" content="en">
<TITLE>PAICyT 2007-2008 - Investigaci&oacute;n - Schaeffer</title>
<LINK rel="stylesheet" type="text/css" href="../../../elisa.principal.css">
</HEAD>
<BODY>
<div id="elementos">  
  <div id="navibar">
    <p>
      <a href="../../../espanol.html">Elisa Schaeffer</a> /
      <a href="../../espanol.html">Investigaci&oacute;n</a> / 
      PAICyT 2007-2008
    </p>
  </div>
<div ID="contenido">
<h1>PAICyT 2007-2008</h1>
<h2>M&eacute;todos locales de agrupamiento de datos</h2>


<p>
<table border="0" cellspacing="0" cellpadding="5">
<tr><th>Vigencia</th><td>07/2007-07/2008</td></tr>
<tr><th>Patrocinador</th><td><a href="http://www.uanl.mx">UANL</a> / <a
href="http://www.uanl.mx/investigacion/paicyt">PAICyT</a></td></tr>
<tr><th>Clave</th><td>CA1475-07</td></tr>
<tr><th>Monto</th><td>65,000 M.N.</td></tr>
<tr><th>LGAC</th>
<td>Modelado y optimizaci&oacute;n de sistemas adaptativos de informaci&oacute;n</td></tr>
</table>
</p>
<p>
<h3>Documentos</h3>
<p>
<ul>
<li><a href="paicyt_2007.pdf">Propuesta</a></li>
<li><a href="paicyt_2007_informe.pdf">Informe</a></li>
</ul>
</p>
<h3>Resumen</h3>
<h4>Importancia y relevancia del proyecto</h4>
<p>
En los problemas de los campos de bioinform&aacute;tica y
miner&iacute;a de datos es com&uacute;n que una instancia
t&iacute;pica del problema est&aacute; estructurado en una manera no
uniforme: est&aacute; compuesto de subproblemas m&aacute;s altamente
restringidas que el problema completo. En muchos casos
pr&aacute;cticos, las propiedades de inter&eacute;s est&aacute;n relacionados
solamente a uno o dos subproblemas densos, por lo cual no es necesario
utilizar los datos completos para ofrecer una soluci&oacute;n
satisfactoria.
</p>
<p>
En este trabajo planteamos el problema de la identificaci&oacute;n de
subproblemas "independientes" y "interesantes" de problemas del mundo
real, es decir, el problema de agrupamiento (ingl&eacute;s:
clustering). El trabajo inicia por definir buenas medidas
estructurales para la identificaci&oacute;n de subproblemas. La
teor&iacute;a de grafos ofrece herramientas poderosas para tales
definiciones. Existen varios m&eacute;todos de agrupamiento global de
grafos, que dividen el grafo entero en subgrafos seg&uacute;n ciertos
criterios. Lo que interesa a nosotros es poder identificar solamente
el subproblema o los subproblemas relevantes desde el punto de vista
de una pregunta de naturaleza local. Ya existen algunas ideas
iniciales sobre el agrupamiento local, pero hace falta trabajo
rigoroso en el desarrollo de algoritmos de agrupamiento local que
sirvan para problemas del mundo real. En las aplicaciones, los datos
suelen ser complejos, aunque los algoritmos existentes no prestan
mucha atenci&oacute;n a las posibilidades incorporar tal complejidad a
trav&eacute;s de ponderaci&oacute;n y direcci&oacute;n los grafos.
</p>
<p>
Nuesto enfoque est&aacute; en problemas del tipo de
optimizaci&oacute;n combinatorial, donde por lo general se busca por
configuraciones que cumplen con ciertos requisitos: las rutas de
entrega m&aacute;s cortas o las ubicaciones m&aacute;s adecuadas para
centros de distribuci&oacute;n, etc&eacute;tera. El problema general
de agrupamiento, como muchos de optimizaci&oacute;n combinatorial, es
NP-dif&iacute;cil. Sin entrar en detalles t&eacute;cnicos, no se cree
que puedan existir algoritmos exactos de soluci&oacute;n con tiempo de
ejecuci&oacute;n que aumente no m&aacute;s r&aacute;pido que
polinomialmente con el tama&ntilde;o del problema. Con procesar
solamente subproblemas, podemos recudir el tama&ntilde;o del
problema. Este efecto combinado con la aplicaci&oacute;n de algoritmos
de aproximaci&oacute;n ya ofrece una soluci&oacute;n viable tal para
datos de tama&ntilde;o masivo como para datos sujetos a cambios y
actualizaciones frecuentes. El reto est&aacute; en explotar
efectivamente la estructura no uniforme de la representaci&oacute;n de
los datos en la forma de un grafo y ejecutar computaciones locales en
paralelo en una sistema multiprocesadora.
</p>
<h4>Metodolog&iacute;a propuesta</h4>
<p>
El desarrollo e implementaci&oacute;n de algoritmos locales de
agrupamiento de grafos de tama&ntilde;o masivo que sean capaces de
ofrecer soluciones de alta calidad r&aacute;pidamente ser&aacute; el
enfoque principal del trabajo propuesto. La hip&oacute;tesis de la
propuesta es que el problema en estudio puede ser resuelto de manera
eficiente, es decir, desde un enfoque de la aplicaci&oacute;n de
m&eacute;todos para optimizar medidas locales matem&aacute;ticamente
fundadas.  Los detalles de la metodolog&iacute;a se exponen en el
protocolo del proyecto.  En resumen, en este trabajo se pretende
llevar a cabo investigaci&oacute;n sobre el agrupamiento local,
relevante en el campo de miner&iacute;a de datos y
biotecnolog&iacute;a. Aplicamos el alg&eacute;bra de grafos y
t&eacute;cnicas avanzadas de optimizaci&oacute;n combinatorial para
desarrollar eficientes m&eacute;todos de soluci&oacute;n; es
aqu&iacute; donde yace la contribuci&oacute;n cient&iacute;fica del
trabajo propuesto. El trabajo involucra un componente computacional
significativo por el tama&ntilde;o de las instancias estudiadas. Hasta
donde se tiene conocimiento, el problema de agrupamiento local
aqu&iacute; planteado todav&iacute;a es un campo abierto con muchas
aplicaciones potenciales de gran impacto y poco trabajo existente.
</p>
<h3>Participantes</h3>
<p>
<ul>
<li>Investigadores
<ul>
<li><a href="../../../espanol.html">Dra. Elisa Schaeffer</a></li>
</ul>
</li>
<li>Colaboradores
<ul>
<li><a href="http://www.tcs.hut.fi/~orponen/">Dr. Pekka Orponen</a>,
Universidad Polit&eacute;cnica de Helsinki (TKK), Finlandia</li>
</ul>
</li>
<li>Estudiantes
<ol>
<li><a href="../../../students/espanol.html#mcavalos2009">Lic. Vanesa
Avalos Gayt&aacute;n - tesis de maestr&iacute;a</a> principalmente
asociado al proyecto, concluida en febrero 2009</li>
<li><a href="../../../students/espanol.html#mccantu2009">Ing. Perla Cant&uacute; Cerda 
- tesis de maestr&iacute;a</a> parcialmente asociado al proyecto, concluida en octubre 2009</li>
<li>Sr. Mario Rivera Ram&iacute;rez (Universidad de Guadalajara) - estancia de verano cient&iacute;fico</li>
<li>Sr. Jes&uacute;s L&oacute;pez Barrios (Universidad Aut&oacute;noma de Sinaloa) - estancia de verano cient&iacute;fico</li>
<li>Sr. Jos&eacute;e Vargas D&iacute;az - estancia de verano cient&iacute;fico PROVERICyT</li>
<li>Sr. Orlando Almanda Vald&eacute;z - estancia de verano cient&iacute;fico PROVERICyT</li>
</ol>
</li>
</ul>
</p>
<h3>Productos</h3>
<p>
<ol>
<li><a href="../../../publications/espanol.html#arxiv2008">Informe t&eacute;cnico en arXiv.org</a></li>
<li><a href="../../../publications/espanol.html#cosrev2007">Art&iacute;culo publicado en CosRev de Elsevier 2007</a></li>
<li><a href="../../../publications/espanol.html#ciencia2009">Art&iacute;culo publicado en Ciencia UANL 2009</a></li>
<li><a href="../../../presentations/espanol.html#enoan2008a">Presentaci&oacute;n de p&oacute;ster en ENOAN 2008, Ing. Cant&uacute;</a></li>
<li><a href="../../../presentations/espanol.html#enoan2008b">Presentaci&oacute;n de p&oacute;ster en ENOAN 2008, Lic. Avalos</a></li>
<li>Ponencia en ILAS 2008, Dra. Schaeffer</li>

</ol>
</p>

</div>
<div id="pie">
Actualizada la &uacute;ltima vez el 5 de octubre del 2010. <br/>
URL: http://elisa.dyndns-web.com/~elisa/research/projects/paicyt/paicyt2007.html
</div>
</div>

</BODY>
</HTML>




