<!DOCTYPE HTML  PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3c.org/html4/HTML4-loose.dtd">
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" content="text/html; charset=iso-8859-1">
<meta http-equiv="content-language" content="en">
<TITLE>PAICyT 2009-2010 - Investigaci&oacute;n - Schaeffer</title>
<LINK rel="stylesheet" type="text/css" href="../../../elisa.principal.css">
</HEAD>
<BODY>
<div id="elementos">  
  <div id="navibar">
    <p>
      <a href="../../../espanol.html">Elisa Schaeffer</a> /
      <a href="../../espanol.html">Investigaci&oacute;n</a> / 
      PAICyT 2009-2010
    </p>
  </div>
<div ID="contenido">
<h1>PAICyT 2009-2010</h1>

<h2>Propiedades estructurales en la sincronizaci&oacute;n y
coordinaci&oacute;n<br/> de grupos colaborativos de agentes
independientes</h2>
<p>
<table border="0" cellspacing="0" cellpadding="5">
<tr><th>Vigencia</th><td>07/2009-07/2010</td></tr>
<tr><th>Patrocinador</th><td><a href="http://www.uanl.mx">UANL</a> / <a
href="http://www.uanl.mx/investigacion/paicyt">PAICyT</a></td></tr>
<tr><th>Clave</th><td>IT264-09</td></tr>
<tr><th>Monto</th><td>65,000 M.N.</td></tr>
<tr><th>LGAC</th>
<td>Modelado y optimizaci&oacute;n de sistemas adaptativos de informaci&oacute;n<br>
Dise&ntilde;o, desarrollo y evaluaci&oacute;n de sistemas adaptativos de informaci&oacute;n</td></tr>
</table>
</p>
<p>
<h3>Documentos</h3>
<p>
<ul>
<li><a href="paicyt_2009.pdf">Propuesta</a></li>
</ul>
</p>
<h3>Resumen</h3>
<p>
En este proyecto se pretende dar una soluci&oacute;n al problema de
control para la sincronizaci&oacute;n de un sistema cooperativo
constituido de robots con estructura homog&eacute;nea para realizar
una tarea de manera coordinada. Un an&aacute;lisis te&oacute;rico
ser&aacute; desarrollado para obtener las condiciones bajo las cuales
se garantice la convergencia r&aacute;pida hacia la trayectoria
deseada de un sistema cooperativo. &Aacute;reas donde intervienen
tales sistemas incluyen los procesos de producci&oacute;n, en especial
los de la industria automotriz. Adem&aacute;s, posibles &aacute;reas
con un gran potencial de aplicaci&oacute;n son la
telemanipulaci&oacute;n y la sincronizaci&oacute;n de oscilaciones en
la locomoci&oacute;n de robots.
</p>
<p>
La metodolog&iacute;a propuesta consiste en un estudio de literatura,
seguido por un an&aacute;lisis te&oacute;rico de las propiedades
estructurales que afectan favorablemente sincronizaci&oacute;n y
coordinaci&oacute;n, dando lugar a desarrollo de algoritmos que
posteriormente se implementa en simulaciones y al final del proyecto
en experimentos con robots f&iacute;sicos.
</p>
<p>
Este proyecto viene a apoyar dos propuestas sometidas a
evaluaci&oacute;n en la convocatoria 2008 de Ciencias B&aacute;sicas
SEP-CONACyT, una por Dra. Schaeffer, la investigador responsable de
esta propuesta, y otra por Dr. Jes&uacute;s de Le&oacute;n
Morales. Con estos proyectos buscamos combinar las fortalezas de las
l&iacute;neas de investigaci&oacute;n de dos grupos en el CIIDIT, el
grupo de Dra. Schaeffer (coordinadora de TI &amp; Software) y el grupo de
Dr. de Le&oacute;n (coordinador de Mecatr&oacute;nica) para realizar
investigaci&oacute;n multidisciplinaria que combina elementos de
optimizaci&oacute;n, teor&iacute;a de grafos, sistemas inteligentes
adaptativos, rob&oacute;tica y teor&iacute;a de control.
</p>
<p>
Contamos con el apoyo de otros investigadores de las dos &aacute;reas
del CIIDIT y un grupo grande de estudiantes de la FIME, entre ellos
varios estudiantes nuevos de doctorado que comienzan sus estudios en
enero del 2009 en los programas doctorales de Ingenier&iacute;a de
Sistemas e la Ingenier&iacute;a El&eacute;ctrica. En la
formaci&oacute;n de recursos humanos colaboramos a trav&eacute;s de
coasesor&iacute;a y comit&eacute;s de tesis. Tambi&eacute;n contamos
con estudiantes de maestr&iacute;a de los dos programas como tesistas
y la participaci&oacute;n de estudiantes de licenciatura de varios
programas educativos en la FIME. En particular estos proyectos vienen
a apoyar en la creaci&oacute;n de un nuevo programa educativo en el
posgrado de la FIME, Doctorado en Ingenier&iacute;a con
Acentuaci&oacute;n en Computaci&oacute;n y Mecatr&oacute;nica,
propuesto por Dra. Schaeffer, Dr. de Le&oacute;n y Dr. Arturo Berrones
Santos de la FIME.
</p>
<p>
Trabajo anterior relacionado a este campo de estudio incluyen el
proyecto PAICyT CA1475-07 de Dra. Schaffer sobre un tipo particular de
propiedades estructurales (el agrupamiento de grafos) y el proyecto
PROMEP 103,5/07/2523 de Dra. Schaeffer sobre b&uacute;squeda adaptativa en
redes din&aacute;micas. Este aplicaci&oacute;n a la rob&oacute;tica
que proponemos es una extensi&oacute;n multidisciplinaria de trabajo
anterior y nos permite r&aacute;pidamente alcanzar un nivel adecuado
para producir publicaciones cient&iacute;ficas de alto nivel y
resultados pr&aacute;cticos de inter&eacute;s de la industria a nivel
regional, nacional e internacional.
</p>
<h3>Participantes</h3>
<p>
<ul>
<li>Investigadores
<ul>
<li><a href="../../../espanol.html">Dra. Elisa Schaeffer</a></li>
</ul>
</li>
<li>Colaboradores
<ul>
<li>Dr. Jes&uacute;s de Le&oacute;n Morales, FIME, UANL</li>
<li><a href="http://it.ciidit.uanl.mx/~arturo/">Dr. J. Arturo Berrones Santos</a>, FIME, UANL</li>
</ul>
</li>
<li>Estudiantes
<ol>
<li>Sr. Carlos Alberto Castillo Salazar - estudiante de licenciatura</li>
<li>Sr. Luis Alberto Ballado Adarias - becario de licenciatura</li>
<li>Sr. Melchor Omar Brondo Guti&eacute;rrez - becario de licenciatura</li>
<li>Lic. Nidia Lizett G&oacute;mez Duarte - estudiante de maestr&iacute;a</li>
<li>M.C. Vanesa Avalos Gayt&aacute;n - estudiante de doctorado</li>
<li>M.C. Tania Turrubiates L&oacute;pez - estudiante de doctorado</li>
</ol>
</li>
</ul>
</p>
<h3>Productos</h3>
<p>
El proyecto todav&iacute;a no ha concluido.
</p>

</div>
<div id="pie">
Actualizada la &uacute;ltima vez el 5 de octubre del 2010. <br/>
URL: http://elisa.dyndns-web.com/~elisa/research/projects/paicyt/paicyt2009.html
</div>
</div>

</BODY>
</HTML>


